#+TITLE: Ryan's Time Log
#+AUTHOR: Ryan Szemplinski
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

*** DONE Class time for the week of the 16th                     :rszempli:
CLOSED: [2014-02-27 Thu 13:51]
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 13:51] \\
  Week is over
CLOCK: [2014-02-20 Thu 15:17]--[2014-02-20 Thu 17:00] =>  1:43
- And again even more class time.
:END:
CLOCK: [2014-02-18 Tue 15:22]--[2014-02-18 Tue 15:50] =>  0:28
- Some more class time
CLOCK: [2014-02-18 Tue 14:57]--[2014-02-18 Tue 15:20] =>  0:23
- More class time
CLOCK: [2014-02-18 Tue 13:40]--[2014-02-18 Tue 14:32] =>  0:52
- Class time
*** DONE Django tutorials                                        :rszempli
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 13:51] \\
  Finished
:END:
**** DONE Go through the main site tutorial [5/5] [100%]
CLOSED: [2014-02-23 Sun 15:06]
:LOGBOOK:
- CLOSING NOTE [2014-02-23 Sun 15:06] \\
  Finished all them tutorials on django webpage
CLOCK: [2014-02-19 Wed 22:06]--[2014-02-19 Wed 23:39] =>  1:33
- Learned some about making some models and the very sexy database viewer
  web page thing and some url stuffzzzz....
:END:
- [X] Part 1
- [X] Part 2
- [X] Part 3
- [X] Part 4
- [X] Part 5
*** TODO Get more experience with org-mode                       :rszempli:
**** TODO Look at more tutorials on it[1/3]
- [X] Learn more hotkeys
- [ ] Memorize the hotkeys
- [ ] Learn to like org-mode
*** TODO Tutorial on Angular.js [[http://docs.angularjs.org/api][Documentation]]                    :rszempli
*** TODO Work on Project CRUD
:LOGBOOK:
CLOCK: [2014-02-27 Thu 13:56]--[2014-02-27 Thu 15:50] =>  1:54
- Working on some CRUD stuff for projects with my roomie BEN
CLOCK: [2014-02-23 Sun 15:06]--[2014-02-23 Sun 16:48] =>  1:42
- Trying to get the forms to work for projects but failed to understand how everything
  links up in our project. Me and Ben need to talk to Dustin or someone.
:END:
*** TODO Class time week of the 23rd                             :rszempli:
:LOGBOOK:
CLOCK: [2014-02-27 Thu 13:49]--[2014-02-27 Thu 16:00] =>  2:11
- Thursday Class time
CLOCK: [2014-02-25 Tue 14:00]--[2014-02-25 Tue 16:00] =>  2:00
- Tuesday Class time
:END:

